atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
/*
 * This file is part of AtomVM.
 *
 * Copyright 2018 Davide Bettio <davide@uninstall.it>
 * Copyright 2020-2023 Fred Dushin <fred@dushin.net>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */

#include <sdkconfig.h>

#ifdef CONFIG_AVM_ENABLE_NETWORK_PORT_DRIVER

#include <atom.h>
#include <context.h>
#include <debug.h>
#include <globalcontext.h>
#include <interop.h>
#include <mailbox.h>
#include <memory.h>
#include <platform_defaultatoms.h>
#include <port.h>
#include <sdkconfig.h>
#include <term.h>
#include <utils.h>

// #define ENABLE_TRACE 1
#include <trace.h>

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
#include <esp32_sys.h>
#include <esp_efuse.h>
#include <esp_efuse_table.h>
#include <esp_log.h>
#include <esp_mac.h>
#include <esp_netif.h>
#include <esp_sntp.h>
#include <esp_wifi.h>
#include <lwip/inet.h>
#pragma GCC diagnostic pop

#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#define TCPIP_HOSTNAME_MAX_SIZE 255

// Reduce the maximum number of networks returned for devices with less ram to help mitigate OOM.
#if defined(CONFIG_IDF_TARGET_ESP32P4) || defined(CONFIG_SPIRAM_USE_MALLOC)
#define MAX_SCAN_RESULTS 64
#elif defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32C61) || defined(CONFIG_IDF_TARGET_ESP32C5)
#define MAX_SCAN_RESULTS 14
#elif defined(CONFIG_IDF_TARGET_ESP32C2)
#define MAX_SCAN_RESULTS 10
#else
#define MAX_SCAN_RESULTS 20
#endif
#define DEFAULT_SCAN_RESULT_MAX 6
#define IDF_DEFAULT_ACTIVE_SCAN_TIME 120
#define IDF_DEFAULT_PASSIVE_SCAN_TIME 360
#define SSID_MAX_SIZE 33
#define BSSID_SIZE 6

#define TAG "network_driver"
#define PORT_REPLY_SIZE (TUPLE_SIZE(2) + REF_SIZE)

static const char *const ap_atom = ATOM_STR("\x2", "ap");
static const char *const ap_channel_atom = ATOM_STR("\xA", "ap_channel");
static const char *const ap_sta_connected_atom = ATOM_STR("\x10", "ap_sta_connected");
static const char *const ap_sta_disconnected_atom = ATOM_STR("\x13", "ap_sta_disconnected");
static const char *const ap_sta_ip_assigned_atom = ATOM_STR("\x12", "ap_sta_ip_assigned");
static const char *const ap_started_atom = ATOM_STR("\xA", "ap_started");
static const char *const dhcp_hostname_atom = ATOM_STR("\xD", "dhcp_hostname");
static const char *const host_atom = ATOM_STR("\x4", "host");
static const char *const managed_atom = ATOM_STR("\x7", "managed");
static const char *const max_connections_atom = ATOM_STR("\xF", "max_connections");
static const char *const psk_atom = ATOM_STR("\x3", "psk");
static const char *const rssi_atom = ATOM_STR("\x4", "rssi");
static const char *const sntp_atom = ATOM_STR("\x4", "sntp");
static const char *const sntp_sync_atom = ATOM_STR("\x9", "sntp_sync");
static const char *const ssid_atom = ATOM_STR("\x4", "ssid");
static const char *const ssid_hidden_atom = ATOM_STR("\xB", "ssid_hidden");
static const char *const sta_atom = ATOM_STR("\x3", "sta");
static const char *const sta_connected_atom = ATOM_STR("\xD", "sta_connected");
static const char *const sta_beacon_timeout_atom = ATOM_STR("\x12", "sta_beacon_timeout");
static const char *const sta_disconnected_atom = ATOM_STR("\x10", "sta_disconnected");
static const char *const sta_got_ip_atom = ATOM_STR("\xA", "sta_got_ip");
static const char *const network_down_atom = ATOM_STR("\x0C", "network_down");

ESP_EVENT_DECLARE_BASE(sntp_event_base);
ESP_EVENT_DEFINE_BASE(sntp_event_base);

enum
{
    SNTP_EVENT_BASE_SYNC
};

enum network_cmd
{
    NetworkInvalidCmd = 0,
    NetworkStartCmd,
    NetworkRssiCmd,
    NetworkStopCmd,
    StaHaltCmd,
    StaConnectCmd,
    NetworkScanCmd,
    NetworkScanStopCmd
};

static const AtomStringIntPair cmd_table[] = {
    { ATOM_STR("\x5", "start"), NetworkStartCmd },
    { rssi_atom, NetworkRssiCmd },
    { ATOM_STR("\x4", "stop"), NetworkStopCmd },
    { ATOM_STR("\x8", "halt_sta"), StaHaltCmd },
    { ATOM_STR("\x7", "connect"), StaConnectCmd },
    { ATOM_STR("\x4", "scan"), NetworkScanCmd },
    { ATOM_STR("\xB", "cancel_scan"), NetworkScanStopCmd },
    SELECT_INT_DEFAULT(NetworkInvalidCmd)
};

struct ClientData
{
    GlobalContext *global;
    uint32_t port_process_id;
    uint32_t owner_process_id;
    uint64_t ref_ticks;
    bool managed;
};

struct ScanData
{
    uint64_t ref_ticks;
    uint32_t owner_process_id;
    uint16_t num_results;
    Context *ctx;
    volatile bool canceled;  // Set to claim cleanup ownership
};

static void scan_done_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data);

static inline term make_atom(GlobalContext *global, AtomString atom_str)
{
    return globalcontext_make_atom(global, atom_str);
}

static inline term authmode_to_atom_term(GlobalContext *global, wifi_auth_mode_t mode)
{
    term authmode = UNDEFINED_ATOM;
    switch (mode) {
        case WIFI_AUTH_OPEN:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x4", "open"));
            break;
        case WIFI_AUTH_WEP:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x3", "wep"));
            break;
        case WIFI_AUTH_WPA_PSK:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x7", "wpa_psk"));
            break;
        case WIFI_AUTH_WPA2_PSK:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x8", "wpa2_psk"));
            break;
        case WIFI_AUTH_WPA_WPA2_PSK:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\xC", "wpa_wpa2_psk"));
            break;
        case WIFI_AUTH_ENTERPRISE:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x3", "eap"));
            break;
        case WIFI_AUTH_WPA3_PSK:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x8", "wpa3_psk"));
            break;
        case WIFI_AUTH_WPA2_WPA3_PSK:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\xD", "wpa2_wpa3_psk"));
            break;
        case WIFI_AUTH_WAPI_PSK:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x4", "wapi"));
            break;
        case WIFI_AUTH_WPA3_ENT_192:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x13", "wpa3_enterprise_192"));
            break;
        case WIFI_AUTH_OWE:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x3", "owe"));
            break;
// NOTE: dummy_ atoms will not be observed in the wild and are not pre-populated to the atom table
#if (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 4, 0))
        case WIFI_AUTH_DUMMY1:
            authmode = make_atom(global, ATOM_STR("\x6", "dummy1"));
            break;
        case WIFI_AUTH_DUMMY2:
            authmode = make_atom(global, ATOM_STR("\x6", "dummy2"));
            break;
#if (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 3, 0))
        case WIFI_AUTH_DUMMY3:
            authmode = make_atom(global, ATOM_STR("\x6", "dummy3"));
            break;
#if (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 2, 0))
        case WIFI_AUTH_DUMMY4:
            authmode = make_atom(global, ATOM_STR("\x6", "dummy4"));
            break;
        case WIFI_AUTH_DUMMY5:
            authmode = make_atom(global, ATOM_STR("\x6", "dummy5"));
            break;
#endif
#endif
#endif
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0))
        case WIFI_AUTH_WPA3_EXT_PSK:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\xC", "wpa3_ext_psk"));
            break;
        case WIFI_AUTH_WPA3_EXT_PSK_MIXED_MODE:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x12", "wpa3_ext_psk_mixed"));
            break;
#endif
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0))
        case WIFI_AUTH_DPP:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x3", "dpp"));
            break;
#endif
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0))
        case WIFI_AUTH_WPA3_ENTERPRISE:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\xf", "wpa3_enterprise"));
            break;
        case WIFI_AUTH_WPA2_WPA3_ENTERPRISE:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x14", "wpa2_wpa3_enterprise"));
            break;
#endif
        case WIFI_AUTH_WPA_ENTERPRISE:
            authmode = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\xE", "wpa_enterprise"));
            break;
        case WIFI_AUTH_MAX:
            authmode = ERROR_ATOM;
            break;
    }
    return authmode;
}

#define UNLIKELY_NOT_ESP_OK(E) UNLIKELY((E) != ESP_OK)

static term tuple_from_addr(Heap *heap, uint32_t addr)
{
    term terms[4];
    terms[0] = term_from_int((addr >> 24) & 0xFF);
    terms[1] = term_from_int((addr >> 16) & 0xFF);
    terms[2] = term_from_int((addr >> 8) & 0xFF);
    terms[3] = term_from_int(addr & 0xFF);

    return port_heap_create_tuple_n(heap, 4, terms);
}

static inline bool ensure_atom(GlobalContext *global, AtomString atom)
{
    return globalcontext_make_atom(global, atom) != term_invalid_term();
}

static bool ensure_scan_atoms_exist(GlobalContext *global)
{
    // Atoms needed in return message
    if (UNLIKELY(!ensure_atom(global, ssid_atom))) {
        return false;
    }
    if (UNLIKELY(!ensure_atom(global, rssi_atom))) {
        return false;
    }
    static const char *const authmode = ATOM_STR("\x8", "authmode");
    if (UNLIKELY(!ensure_atom(global, authmode))) {
        return false;
    }
    static const char *const bssid = ATOM_STR("\x5", "bssid");
    if (UNLIKELY(!ensure_atom(global, bssid))) {
        return false;
    }
    static const char *const channel = ATOM_STR("\x7", "channel");
    if (UNLIKELY(!ensure_atom(global, channel))) {
        return false;
    }
    static const char *const hidden = ATOM_STR("\x6", "hidden");
    if (UNLIKELY(!ensure_atom(global, hidden))) {
        return false;
    }
    static const char *const unregister_handler = ATOM_STR("\x12", "unregister_handler");
    if (UNLIKELY(!ensure_atom(global, unregister_handler))) {
        return false;
    }
    static const char *const scan_canceled = ATOM_STR("\xD", "scan_canceled");
    if (UNLIKELY(!ensure_atom(global, scan_canceled))) {
        return false;
    }

    // Common auth atoms, not every auth atom is preloaded
    static const char *const open = ATOM_STR("\x4", "open");
    if (UNLIKELY(!ensure_atom(global, open))) {
        return false;
    }
    static const char *const wep = ATOM_STR("\x3", "wep");
    if (UNLIKELY(!ensure_atom(global, wep))) {
        return false;
    }
    static const char *const wpa_psk = ATOM_STR("\x7", "wpa_psk");
    if (UNLIKELY(!ensure_atom(global, wpa_psk))) {
        return false;
    }
    static const char *const wpa2_psk = ATOM_STR("\x8", "wpa2_psk");
    if (UNLIKELY(!ensure_atom(global, wpa2_psk))) {
        return false;
    }
    static const char *const wpa_wpa2_psk = ATOM_STR("\xC", "wpa_wpa2_psk");
    if (UNLIKELY(!ensure_atom(global, wpa_wpa2_psk))) {
        return false;
    }
    static const char *const wpa3_psk = ATOM_STR("\x8", "wpa3_psk");
    if (UNLIKELY(!ensure_atom(global, wpa3_psk))) {
        return false;
    }
    static const char *const eap = ATOM_STR("\x3", "eap");
    if (UNLIKELY(!ensure_atom(global, eap))) {
        return false;
    }
    static const char *const wpa2_wpa3_psk = ATOM_STR("\xD", "wpa2_wpa3_psk");
    if (UNLIKELY(!ensure_atom(global, wpa2_wpa3_psk))) {
        return false;
    }
    static const char *const wapi = ATOM_STR("\x4", "wapi");
    if (UNLIKELY(!ensure_atom(global, wapi))) {
        return false;
    }
    static const char *const wpa3_enterprise_192 = ATOM_STR("\x13", "wpa3_enterprise_192");
    if (UNLIKELY(!ensure_atom(global, wpa3_enterprise_192))) {
        return false;
    }
    static const char *const owe = ATOM_STR("\x3", "owe");
    if (UNLIKELY(!ensure_atom(global, owe))) {
        return false;
    }
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0))
    static const char *const wpa3_ext_psk = ATOM_STR("\xC", "wpa3_ext_psk");
    if (UNLIKELY(!ensure_atom(global, wpa3_ext_psk))) {
        return false;
    }
    static const char *const wpa3_ext_psk_mixed = ATOM_STR("\x12", "wpa3_ext_psk_mixed");
    if (UNLIKELY(!ensure_atom(global, wpa3_ext_psk_mixed))) {
        return false;
    }
#endif
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0))
    static const char *const dpp = ATOM_STR("\x3", "dpp");
    if (UNLIKELY(!ensure_atom(global, dpp))) {
        return false;
    }
#endif
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0))
    static const char *const wpa3_enterprise = ATOM_STR("\xF", "wpa3_enterprise");
    if (UNLIKELY(!ensure_atom(global, wpa3_enterprise))) {
        return false;
    }
    static const char *const wpa2_wpa3_enterprise = ATOM_STR("\x14", "wpa2_wpa3_enterprise");
    if (UNLIKELY(!ensure_atom(global, wpa2_wpa3_enterprise))) {
        return false;
    }
#endif
    static const char *const wpa_enterprise = ATOM_STR("\xE", "wpa_enterprise");
    if (UNLIKELY(!ensure_atom(global, wpa_enterprise))) {
        return false;
    }
    return true;
}

