atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
// heap must be allocated and free'd by the caller
static void send_scan_error_from_task(GlobalContext *global, uint32_t local_process_id, term reason, uint64_t ref_ticks, Heap heap)
{
    term ref = term_from_ref_ticks(ref_ticks, &heap);
    term pid = term_from_local_process_id(local_process_id);
    term error_tuple = port_heap_create_error_tuple(&heap, reason);
    term scan_results_atom = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\xC", "scan_results"));
    term ret = port_heap_create_tuple2(&heap, scan_results_atom, error_tuple);
    term msg = port_heap_create_tuple2(&heap, ref, ret);
    port_send_message_from_task(global, pid, msg);
}

static void send_scan_results(struct ScanData *data)
{
    if (UNLIKELY(data == NULL)) {
        return;
    }
    GlobalContext *global = data->ctx->global;
    Context *ctx = data->ctx;
    uint16_t discovered = 0;
    esp_err_t err = esp_wifi_scan_get_ap_num(&discovered);
    if (UNLIKELY(err != ESP_OK)) {
        // the ap_list must be cleared on failures to prevent a memory leak
        esp_wifi_clear_ap_list();
        const char *error = esp_err_to_name(err);
        ESP_LOGE(TAG, "Failed to obtain number of networks found, reason: %s", error);
        size_t error_len = strlen(error);

        // Handler should always be unregistered before sending a reply to avoid a race condition,
        // once the message is sent another scan can be initiated, removing the handler after
        // sending the reply could remove the new one.
        err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);

        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len), heap);
        term reason = term_from_const_binary((const uint8_t *) error, (uint16_t) error_len, &heap, global);
        send_scan_error_from_task(global, data->owner_process_id, reason, data->ref_ticks, heap);
        END_WITH_STACK_HEAP(heap, global);

        if (UNLIKELY(err != ESP_OK)) {
            goto unregister_failed;
        } else {
            __atomic_store_n((void **)&ctx->platform_data, NULL, __ATOMIC_RELEASE);
            free(data);
        }
        return;
    }
    ESP_LOGD(TAG, "Scan found %u networks.", discovered);

    uint16_t num_results = data->num_results;
    uint16_t return_results;
    if (discovered > num_results) {
        return_results = num_results;
    } else {
        return_results = discovered;
    }
    wifi_ap_record_t *ap_records = NULL;
    if (return_results > 0) {
        ap_records = (wifi_ap_record_t *) calloc((size_t) return_results, sizeof(wifi_ap_record_t));
        if (IS_NULL_PTR(ap_records)) {
            esp_wifi_clear_ap_list();

            err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);

            BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2), heap);
            send_scan_error_from_task(global, data->owner_process_id, OUT_OF_MEMORY_ATOM, data->ref_ticks, heap);
            END_WITH_STACK_HEAP(heap, global);

            if (UNLIKELY(err != ESP_OK)) {
                goto unregister_failed;
            } else {
                __atomic_store_n((void **)&ctx->platform_data, NULL, __ATOMIC_RELEASE);
                free(data);
            }
            return;
        }
        err = esp_wifi_scan_get_ap_records(&return_results, ap_records);
    } else {
        esp_wifi_clear_ap_list();
        err = ESP_OK;
    }

    if (UNLIKELY(err != ESP_OK)) {
        esp_wifi_clear_ap_list();
        free(ap_records);
        ap_records = NULL;
        const char *error = esp_err_to_name(err);
        ESP_LOGE(TAG, "Failed to obtain scan results, reason: %s", error);
        size_t error_len = strlen(error);

        err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);

        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len), heap);
        term reason = term_from_const_binary((const uint8_t *) error, (uint16_t) error_len, &heap, global);
        send_scan_error_from_task(global, data->owner_process_id, reason, data->ref_ticks, heap);
        END_WITH_STACK_HEAP(heap, global);

        if (UNLIKELY((err != ESP_OK) && (err != ESP_ERR_NOT_FOUND))) {
            goto unregister_failed;
        } else {
            __atomic_store_n((void **)&ctx->platform_data, NULL, __ATOMIC_RELEASE);
            free(data);
        }
        return;
    }

    // ap_data example: {scan_results, {NumberResults, [#{authmode => Mode, bssid => Bssid, channel => ChNumber, hidden => Bool, rssi => DBM, ssid => SSID}]}}
    size_t ap_data_size = (TERM_MAP_SIZE(6) + TERM_BINARY_HEAP_SIZE(SSID_MAX_SIZE) + TERM_BINARY_HEAP_SIZE(BSSID_SIZE));
    size_t results_size = (PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + BOXED_INT_SIZE + LIST_SIZE(return_results, ap_data_size));
    ESP_LOGD(TAG, "Requesting size '%zu' on heap for scan results", results_size);

    Heap heap;
    if (UNLIKELY(memory_init_heap(&heap, results_size) != MEMORY_GC_OK)) {
        esp_wifi_clear_ap_list();
        free(ap_records);
        ap_records = NULL;
        err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);

        BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2), err_heap);
        send_scan_error_from_task(global, data->owner_process_id, OUT_OF_MEMORY_ATOM, data->ref_ticks, err_heap);
        END_WITH_STACK_HEAP(err_heap, global);
        if (UNLIKELY(err != ESP_OK)) {
            goto unregister_failed;
        } else {
            __atomic_store_n((void **)&ctx->platform_data, NULL, __ATOMIC_RELEASE);
            free(data);
        }
        return;
    }

    // Unregister the callback, but do not report any problems until after results have been sent.
    err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);

    term networks_data_list = term_nil();
    if (return_results != 0) {
        networks_data_list = wifi_ap_records_to_list_maybe_gc(global, ap_records, return_results, &heap);
    }
    free(ap_records);
    ap_records = NULL;

    term scan_results = port_heap_create_tuple2(&heap, term_from_int(discovered), networks_data_list);

    term scan_results_atom = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\xC", "scan_results"));
    term results_tuple = port_heap_create_tuple2(&heap, scan_results_atom, scan_results);

