atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
            case SNTP_EVENT_BASE_SYNC: {
                ESP_LOGI(TAG, "SNTP_EVENT_BASE_SYNC received.");
                send_sntp_sync(data, (struct timeval *) event_data);
                break;
            }

            default:
                ESP_LOGI(TAG, "Unhandled sntp event: %" PRIi32 ".", event_id);
                break;
        }

    } else {
        ESP_LOGI(TAG, "Unhandled network event: %" PRIi32 ".", event_id);
    }
}

static void scan_done_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
    struct ScanData *data = arg;

    // Claim ownership before any data dereference. If we lose the CAS cancel_scan handles cleanup.
    bool expected = false;
    bool desired = true;
    if (!__atomic_compare_exchange(&data->canceled, &expected, &desired, false, __ATOMIC_SEQ_CST, __ATOMIC_SEQ_CST)) {
        return;
    }

    GlobalContext *global = data->ctx->global;

    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_SCAN_DONE) {
        wifi_event_sta_scan_done_t *scan_done = (wifi_event_sta_scan_done_t *) event_data;
        if (scan_done->status == 0) {
            ESP_LOGD(TAG, "Scan complete.");
            send_scan_results(data);
        } else {
            ESP_LOGW(TAG, "Scan ended with status: failure");
            esp_wifi_clear_ap_list();
            esp_err_t err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
            BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2), heap);
            send_scan_error_from_task(global, data->owner_process_id,
                globalcontext_existing_term_from_atom_string(global, ATOM_STR("\xD", "scan_canceled")),
                data->ref_ticks, heap);
            END_WITH_STACK_HEAP(heap, global);
            if (LIKELY(err == ESP_OK)) {
                __atomic_store_n((void **)&data->ctx->platform_data, NULL, __ATOMIC_RELEASE);
                free(data);
            } else {
                const char *error = esp_err_to_name(err);
                ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, future scans may fail", error);
                size_t error_len = strlen(error);

                BEGIN_WITH_STACK_HEAP(PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len), err_heap);
                term reason = term_from_const_binary((const uint8_t *) error, (uint16_t) error_len, &err_heap, global);
                term unregister_handler_atom = globalcontext_existing_term_from_atom_string(global, ATOM_STR("\x12", "unregister_handler"));
                term reason_tuple = port_heap_create_tuple2(&err_heap, unregister_handler_atom, reason);
                term error_tuple = port_heap_create_error_tuple(&err_heap, reason_tuple);

                term payload = port_heap_create_tuple2(&err_heap, globalcontext_existing_term_from_atom_string(global, ATOM_STR("\xC", "scan_results")), error_tuple);
                term reference = term_from_ref_ticks(data->ref_ticks, &err_heap);
                term message = port_heap_create_tuple2(&err_heap, reference, payload);
                port_send_message_from_task(global, term_from_local_process_id(data->owner_process_id), message);
                END_WITH_STACK_HEAP(err_heap, global);

                // Always clean up to unblock cancel_scan's spin-wait loop.
                __atomic_store_n((void **)&data->ctx->platform_data, NULL, __ATOMIC_RELEASE);
                free(data);

            }
        }
    }
}

//
// message processing
//

static wifi_config_t *get_sta_wifi_config(term sta_config, GlobalContext *global)
{
    if (term_is_invalid_term(sta_config)) {
        TRACE("No STA config\n");
        return NULL;
    }
    term ssid_term = interop_kv_get_value(sta_config, ssid_atom, global);
    term pass_term = interop_kv_get_value(sta_config, psk_atom, global);
    term managed_term = interop_kv_get_value_default(sta_config, managed_atom, FALSE_ATOM, global);

    bool roaming = false;
    if ((!term_is_invalid_term(managed_term)) && (managed_term != FALSE_ATOM)) {
        roaming = true;
    }

    //
    // Check parameters
    //
    if (term_is_invalid_term(ssid_term)) {
        if (roaming != true) {
            ESP_LOGE(TAG, "get_sta_wifi_config: Missing SSID");
        }
        return NULL;
    }
    int ok = 0;
    char *ssid = interop_term_to_string(ssid_term, &ok);
    if (!ok || IS_NULL_PTR(ssid)) {
        ESP_LOGE(TAG, "get_sta_wifi_config: Invalid SSID");
        return NULL;
    }

    char *psk = NULL;
    if (term_is_invalid_term(pass_term)) {
        ESP_LOGW(TAG, "Warning: Attempting to connect to open network");
    } else {
        psk = interop_term_to_string(pass_term, &ok);
        if (!ok) {
            free(ssid);
            ESP_LOGE(TAG, "get_sta_wifi_config: Invalid PSK");
            return NULL;
        }
    }

    //
    // Allocate wifi_config and check variable sizes
    //
    wifi_config_t *wifi_config = malloc(sizeof(wifi_config_t));
    if (IS_NULL_PTR(wifi_config)) {
        ESP_LOGE(TAG, "Failed to allocate wifi_config_t for sta");
        return NULL;
    }
    if (UNLIKELY(strlen(ssid) > sizeof(wifi_config->sta.ssid))) {
        ESP_LOGE(TAG, "ssid cannot be more than %d characters", sizeof(wifi_config->sta.ssid));
        free(ssid);
        free(psk);
        return NULL;
    }
    if (!IS_NULL_PTR(psk) && UNLIKELY(strlen(psk) > sizeof(wifi_config->sta.password))) {
        ESP_LOGE(TAG, "psk cannot be more than %d characters", sizeof(wifi_config->sta.password));
        free(ssid);
        free(psk);
        return NULL;
    }

    //
    // Initialize the wifi_config structure
    //
    memset(wifi_config, 0, sizeof(wifi_config_t));
    strcpy((char *) wifi_config->sta.ssid, ssid);
    if (!IS_NULL_PTR(psk)) {
        strcpy((char *) wifi_config->sta.password, psk);
        free(psk);
    }
    free(ssid);

    //
    // done
    //
    ESP_LOGI(TAG, "STA ssid: %s", wifi_config->sta.ssid);
    return wifi_config;
}

static char *get_default_device_name(esp_mac_type_t interface)
{
    uint8_t mac[6];
    esp_read_mac(mac, interface);

    size_t buf_size = strlen("atomvm-") + 12 + 1;
    char *buf = malloc(buf_size);
    if (IS_NULL_PTR(buf)) {
        ESP_LOGE(TAG, "Failed to allocate device name buf");
        return NULL;
    }
    snprintf(buf, buf_size,
        "atomvm-%02x%02x%02x%02x%02x%02x", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    return buf;
}

