atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
static void wifi_scan(Context *ctx, term pid, term ref, term config)
{
    static const char *const scan_results = ATOM_STR("\xC", "scan_results");
    term results_atom = globalcontext_make_atom(ctx->global, scan_results);
    if (UNLIKELY(results_atom == term_invalid_term())) {
        size_t error_size = PORT_REPLY_SIZE + TUPLE_SIZE(2);
        port_ensure_available(ctx, error_size);
        term ret = port_create_error_tuple(ctx, OUT_OF_MEMORY_ATOM);
        port_send_reply(ctx, pid, ref, ret);
        return;
    }

    wifi_mode_t mode;
    esp_err_t err = esp_wifi_get_mode(&mode);
    if ((err != ESP_OK) || ((mode != WIFI_MODE_STA) && (mode != WIFI_MODE_APSTA))) {
        ESP_LOGE(TAG, "WiFi must already be configured in STA or AP+STA mode to use network:wifi_scan/0,1");
        term reason = make_atom(ctx->global, ATOM_STR("\x10", "unsupported_mode"));
        if (UNLIKELY(reason == term_invalid_term())) {
            reason = OUT_OF_MEMORY_ATOM;
        }
        send_scan_error_reason(ctx, pid, ref, reason);
        return;
    }

    term cfg_results = interop_kv_get_value_default(config, ATOM_STR("\x7", "results"), term_from_int(DEFAULT_SCAN_RESULT_MAX), ctx->global);
    if (UNLIKELY(!term_is_integer(cfg_results))) {
        ESP_LOGE(TAG, "results option must be an integer (i.e. {results, 6})");
        send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
        return;
    }

    int32_t requested_results = term_to_int32(cfg_results);
    if (UNLIKELY((requested_results < 1) || (requested_results > MAX_SCAN_RESULTS))) {
        ESP_LOGE(TAG, "results option must be between 1 and %i on this platform.", MAX_SCAN_RESULTS);
        send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
        return;
    }
    uint16_t num_results = (uint16_t) requested_results;
    ESP_LOGD(TAG, "Scan will return a maximum of %u results", num_results);

    term term_passive = interop_kv_get_value_default(config, ATOM_STR("\x7", "passive"), term_invalid_term(), ctx->global);
    bool passive_scan = false;
    term passive_atom = globalcontext_existing_term_from_atom_string(ctx->global, ATOM_STR("\x7", "passive"));
    if (!term_is_invalid_term(term_passive)) {
        if ((term_passive == TRUE_ATOM) || (term_passive == passive_atom)) {
            passive_scan = true;
        } else if (term_passive != FALSE_ATOM) {
            send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
            return;
        }
    }

    term cfg_dwell = interop_kv_get_value_default(config, ATOM_STR("\x5", "dwell"), term_invalid_term(), ctx->global);
    uint32_t dwell_ms = 0;
    if (cfg_dwell == term_invalid_term()) {
        if (passive_scan == false) {
            dwell_ms = IDF_DEFAULT_ACTIVE_SCAN_TIME;
        } else {
            dwell_ms = IDF_DEFAULT_PASSIVE_SCAN_TIME;
        }
    } else {
        if (UNLIKELY(!term_is_integer(cfg_dwell))) {
            ESP_LOGE(TAG, "Channel dwell time milliseconds must be an integer (example: {dwell, 250})");
            send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
            return;
        }
        int32_t dwell_config = term_to_uint32(cfg_dwell);
        if (UNLIKELY((dwell_config < 1lu) || (dwell_config > 1500lu))) {
            ESP_LOGE(TAG, "Per channel dwell time milliseconds must be between 1 and 1500");
            send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
            return;
        }

        dwell_ms = (uint32_t) dwell_config;
        ESP_LOGD(TAG, "Scan will spend %lu ms per channel", dwell_ms);
    }

    term term_hidden = interop_kv_get_value_default(config, ATOM_STR("\xB", "show_hidden"), term_invalid_term(), ctx->global);
    bool show_hidden = false;

    term hidden_atom = globalcontext_existing_term_from_atom_string(ctx->global, ATOM_STR("\xB", "show_hidden"));
    if (!term_is_invalid_term(term_hidden)) {
        if ((term_hidden == TRUE_ATOM) || (term_hidden == hidden_atom)) {
            show_hidden = true;
        } else if (term_hidden != FALSE_ATOM) {
            send_scan_error_reason(ctx, pid, ref, BADARG_ATOM);
            return;
        }
    }

    wifi_scan_type_t scan_type = WIFI_SCAN_TYPE_ACTIVE;
    if (passive_scan) {
        scan_type = WIFI_SCAN_TYPE_PASSIVE;
    }

    wifi_scan_config_t *scan_config = (wifi_scan_config_t *) calloc(1, sizeof(wifi_scan_config_t));
    if (IS_NULL_PTR(scan_config)) {
        ESP_LOGE(TAG, "Unable to allocate memory for configuration");
        send_scan_error_reason(ctx, pid, ref, OUT_OF_MEMORY_ATOM);
        return;
    }

    if (scan_type == WIFI_SCAN_TYPE_ACTIVE) {
        scan_config->scan_time.active.max = dwell_ms;
        // For fast scans use the same min time as max (like ESP-IDF default), but for longer
        // per-channel dwell times set the min scan time to 1/2 of the maximum, but never less
        // than the 120ms min used in the default scan.
        if (dwell_ms > IDF_DEFAULT_ACTIVE_SCAN_TIME * 2) {
            scan_config->scan_time.active.min = (dwell_ms / 2);
        } else {
            scan_config->scan_time.active.min = dwell_ms;
        }
    } else {
        scan_config->scan_time.passive = dwell_ms;
        if (dwell_ms > 1000) {
            // Increase home channel dwell between scanning consecutive channel from 30 to 60ms to prevent beacon timeouts
            scan_config->home_chan_dwell_time = 60;
        }
    }

    scan_config->show_hidden = show_hidden;
    scan_config->scan_type = scan_type;

    if (UNLIKELY(!ensure_scan_atoms_exist(ctx->global))) {
        ESP_LOGE(TAG, "Unable to allocate atoms for scan return, atom table exhausted or OOM!");
        send_scan_error_reason(ctx, pid, ref, OUT_OF_MEMORY_ATOM);
        free(scan_config);
        return;
    }

    struct ScanData *data = malloc(sizeof(struct ScanData));
    if (IS_NULL_PTR(data)) {
        ESP_LOGE(TAG, "Failed to allocate ClientData");
        send_scan_error_reason(ctx, pid, ref, OUT_OF_MEMORY_ATOM);
        free(scan_config);
        return;
    }
    data->ctx = ctx;
    data->owner_process_id = term_to_local_process_id(pid);
    data->ref_ticks = term_to_ref_ticks(ref);
    data->num_results = num_results;
    data->canceled = false;
    ctx->platform_data = (void *) data;

