atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
    if ((err = esp_event_handler_register(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler, data)) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register wifi event handler");
        send_scan_error_reason(ctx, pid, ref, term_from_int(err));
        ctx->platform_data = NULL;
        free(data);
        data = NULL;
        free(scan_config);
        return;
    }

    err = esp_wifi_scan_start(scan_config, false);
    free(scan_config);
    scan_config = NULL;
    if (UNLIKELY(err != ESP_OK)) {
        const char *err_str = esp_err_to_name(err);
        size_t error_len = strlen(err_str);
        size_t error_size = PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len);
        port_ensure_available(ctx, error_size);
        term reason = term_from_literal_binary((const uint8_t *) err_str, (uint16_t) error_len, &ctx->heap, ctx->global);
        term scan_results_atom = globalcontext_existing_term_from_atom_string(ctx->global, ATOM_STR("\xC", "scan_results"));
        term ret = port_create_tuple2(ctx, scan_results_atom, port_create_error_tuple(ctx, reason));
        err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
        port_send_reply(ctx, pid, ref, ret);
        if (UNLIKELY(err != ESP_OK)) {
            const char *error = esp_err_to_name(err);
            ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, to prevent memory leaks future scans will not be permitted", error);
            size_t error_len = strlen(error);
            port_ensure_available(ctx, PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len));

            term reason = term_from_const_binary((const uint8_t *) error, (uint16_t) error_len, &ctx->heap, ctx->global);
            term unregister_handler_atom = globalcontext_existing_term_from_atom_string(ctx->global, ATOM_STR("\x12", "unregister_handler"));
            term reason_tuple = port_create_tuple2(ctx, unregister_handler_atom, reason);
            term error_tuple = port_create_error_tuple(ctx, reason_tuple);
            term message = port_create_tuple2(ctx, globalcontext_existing_term_from_atom_string(ctx->global, ATOM_STR("\xC", "scan_results")), error_tuple);

            port_send_reply(ctx, pid, ref, message);

        } else {
            ctx->platform_data = NULL;
            free(data);
            data = NULL;
        }
        return;
    }

    // Only send a reply when requested by the gen_server, this should only be sent when using callbacks.
    // Direct calls expect an error, or wait for a results reply.
    term reply_term = interop_kv_get_value_default(config, ATOM_STR("\x5", "reply"), term_invalid_term(), ctx->global);
    if (!term_is_invalid_term(reply_term) && (reply_term == TRUE_ATOM)) {
        port_ensure_available(ctx, PORT_REPLY_SIZE);
        port_send_reply(ctx, pid, ref, OK_ATOM);
    }

    return;
}

static void cancel_scan(Context *ctx, term pid, term ref, term reply_config)
{
    term scan_canceled_atom = globalcontext_existing_term_from_atom_string(ctx->global, ATOM_STR("\xD", "scan_canceled"));
    struct ScanData *data = ctx->platform_data;

    if (data == NULL) {
        size_t reply_size = PORT_REPLY_SIZE + TUPLE_SIZE(3);
        port_ensure_available(ctx, reply_size);
        term reply = port_create_tuple3(ctx, scan_canceled_atom, reply_config, OK_ATOM);
        port_send_reply(ctx, pid, ref, reply);
        return;
    }

    // Claim cleanup ownership atomically. If we lose the CAS, send_scan_results already has ownership.
    bool expected = false;
    bool desired = true;
    bool claimed = __atomic_compare_exchange(&data->canceled, &expected, &desired, false, __ATOMIC_SEQ_CST, __ATOMIC_SEQ_CST);

    esp_err_t err = esp_wifi_scan_stop();
    if (UNLIKELY(err == ESP_ERR_WIFI_STATE)) {
        ESP_LOGE(TAG, "Unable to stop wifi scan, wifi is negotiating a connection to an access point");

        // Release ownership so handler can clean up when scan completes
        if (claimed) {
            bool released = false;
            __atomic_store(&data->canceled, &released, __ATOMIC_SEQ_CST);
        }

        size_t error_size = PORT_REPLY_SIZE + TUPLE_SIZE(3) + TUPLE_SIZE(2);
        port_ensure_available(ctx, error_size);

        term reason = make_atom(ctx->global, ATOM_STR("\xE", "sta_connecting"));
        if (UNLIKELY(reason == term_invalid_term())) {
            reason = OUT_OF_MEMORY_ATOM;
        }
        term error_tuple = port_create_error_tuple(ctx, reason);
        term ret = port_create_tuple3(ctx, scan_canceled_atom, reply_config, error_tuple);
        port_send_reply(ctx, pid, ref, ret);
        return;

    } else if (UNLIKELY(err != ESP_OK)) {
        const char *err_str = esp_err_to_name(err);
        size_t error_len = strlen(err_str);

        // Release ownership so handler can clean up when scan completes
        if (claimed) {
            bool released = false;
            __atomic_store(&data->canceled, &released, __ATOMIC_SEQ_CST);
        }

        size_t error_size = PORT_REPLY_SIZE + TUPLE_SIZE(3) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len);
        port_ensure_available(ctx, error_size);

        term reason = term_from_const_binary((const uint8_t *) err_str, (uint16_t) error_len, &ctx->heap, ctx->global);
        term error_tuple = port_create_error_tuple(ctx, reason);
        term ret = port_create_tuple3(ctx, scan_canceled_atom, reply_config, error_tuple);
        port_send_reply(ctx, pid, ref, ret);
        return;
    }

    // If we lost the CAS, send_scan_results claimed ownership and will clean up,
    // we must NOT free or NULL platform_data. We must wait for it to complete
    // to prevent the Context from being freed while send_scan_results is still running.
    bool unregister_failed = false;
    if (!claimed) {
        while (__atomic_load_n((void **)&ctx->platform_data, __ATOMIC_ACQUIRE) != NULL) {
            // Spin until handler sets ctx->platform_data = NULL after free
        }
    } else {
        err = esp_event_handler_unregister(WIFI_EVENT, WIFI_EVENT_SCAN_DONE, &scan_done_handler);
        if (UNLIKELY(err != ESP_OK)) {
            unregister_failed = true;
        }
        esp_wifi_clear_ap_list();
        ctx->platform_data = NULL;
        free(data);
    }

    size_t reply_size = PORT_REPLY_SIZE + TUPLE_SIZE(3);
    port_ensure_available(ctx, reply_size);
    term reply = port_create_tuple3(ctx, scan_canceled_atom, reply_config, OK_ATOM);
    port_send_reply(ctx, pid, ref, reply);

    if (UNLIKELY(unregister_failed)) {
        const char *error = esp_err_to_name(err);
        ESP_LOGE(TAG, "Failed to unregister event handler for reason %s, to prevent memory leaks future scans will not be permitted", error);
        size_t error_len = strlen(error);
        port_ensure_available(ctx, PORT_REPLY_SIZE + TUPLE_SIZE(2) + TUPLE_SIZE(2) + TERM_BINARY_HEAP_SIZE(error_len));

        term reason = term_from_const_binary((const uint8_t *) error, (uint16_t) error_len, &ctx->heap, ctx->global);
        term unregister_handler_atom = globalcontext_existing_term_from_atom_string(ctx->global, ATOM_STR("\x12", "unregister_handler"));
        term reason_tuple = port_create_tuple2(ctx, unregister_handler_atom, reason);
        term error_tuple = port_create_error_tuple(ctx, reason_tuple);
        term message = port_create_tuple2(ctx, globalcontext_existing_term_from_atom_string(ctx->global, ATOM_STR("\xC", "scan_results")), error_tuple);

